@extends('layouts.client')

@section('title', 'Фенотипи та геннотипи коноплі | HEMPLY.CLUB - Інформаційний ресурс про коноплі українською')
@section('description', 'HEMPLY.CLUB - Актуальні новини та тренди конопляного світу. Інформаційний ресурс про коноплі українською')

@section('content')
    <header class="header-page">
        <div class="container">
            <div class="heading pt-4">
                <h1 class="fs-2 fw-bold text-white">Фенотипи та генотипи</h1>
                <nav aria-label="breadcrumb">
                    <ol class="breadcrumb">
                        <li class="breadcrumb-item">
                            <a href="{{ route('home') }}" class="fw-bold">Головна</a>
                        </li>
                        <li class="breadcrumb-item active" aria-current="page">Фенотипи та генотипи</li>
                    </ol>
                </nav>
            </div>
        </div>
    </header>

    <section class="pt-5 pb-5">
        <div class="container">

            <h2 class="fs-4 fw-bold text-primary">Генотип конопель</h2>

            <p class="fs-6 lead">
                <b>Генотип</b> є повним набором всіх генів організму, у разі конопель. Він несе в собі інформацію про те, як рослина буде розвиватися, які отримає властивості і які особливості матиме. Весь цей набір генів канабіс успадковує від своїх батьків. Якщо висловлюватися простіше, то генотип конопель – це унікальні властивості рослини, які передаються з покоління до покоління і є незмінними.
            </p>

            <p class="fs-6 lead">
                На ринку насіння каннабісу дуже мало генетично чистих сортів. Ви рідко зустрінете чисту індику чи сативу, крім деяких бридерів (селекціонерів).
                Змішуючи різні генотипи, селекціонери намагаються досягти найкращого ефекту, відбираючи найкращі якості у кожної материнської рослини. Деякі флористи поблажливо ставляться до гібридів, але, по суті, усі наявні у продажу варіації конопель були так чи інакше виведені шляхом генетичного схрещування, а отже, є тією чи іншою мірою гібридами.
            </p>

            <p class="fs-6 lead">
                За виведення автоквітучих сортів ми також повинні подякувати вмілим бридерам (особливо Joint Doctor). Використовуючи генотип каннабісу рудералісу, який не має психоактивного ефекту і вважається просто бур'яном, вони змогли наділити сортову марихуану можливістю приносити врожай у рекордно короткі терміни.
            </p>

            <h2 class="fs-4 fw-bold text-primary">Фенотип конопель</h2>

            <p class="fs-6 lead">
                <b>Фенотип</b>, на відміну генотипу, може змінюватися під впливом навколишнього середовища. По суті, це той же набір генів, але що розвивається у певних умовах. Тобто він характеризує не показники даного сорту загалом, а конкретної рослини на даний момент часу. Наприклад, якщо ми візьмемо два насіння одного й того ж сорту з ідентичним генотипом і помістимо їх у різні умови, то й розвиватимуться вони по-різному. Кущ може вирости вище або нижче, мати різну форму суцвіть, відрізнятись за врожайністю і навіть мати різні
                <a href="{{ route('terpene.page') }}" class="fw-bold">смакоароматичні характеристики</a>.
            </p>

            <p class="fs-6 lead">Якщо помістити певний генотип у конкретні умови довкілля, ми й отримаємо фенотип.</p>

            @foreach($phenotypes as $phenotype)
                <a href="{{ route('phenotype.view', $phenotype->slug) }}" class="card mb-4">
                    <div class="card-body">
                        <h5 class="mb-0 fw-bold text-uppercase">{{ $phenotype->name }}</h5>
                    </div>
                </a>
            @endforeach

            <p class="fs-6 lead">Існує ціла маса факторів, що впливають на формування фенотипу конопель. До них можна віднести:</p>

            <ul class="fs-6 lead">
                <li>температуру у приміщенні;</li>
                <li>вологість повітря;</li>
                <li>освітлення та світловий режим;</li>
                <li>тип субстрату;</li>
                <li>використання підживлення;</li>
                <li>режим поливу та багато іншого.</li>
            </ul>

            <h2 class="fs-4 fw-bold text-primary">У чому відмінності генотипу та фенотипу коноплі</h2>

            <p>Підсумовуючи, можна сказати, що генотип конопель є незмінним і стабільним показником, а фенотип варіюється залежно від зовнішніх умов. Маючи однаковий набір генів, рослина, яка росла під яскравим освітленням, буде невисоким, пишним і матиме один фенотип, а абсолютно аналогічне з тим же набором генів, але якому, наприклад, не вистачало світла, буде витягнутим і худим, тобто мати іншим фенотипом.</p>

            <p>Ідентичний генотип властивий усім рослинам одного сорту, але кожна конкретна особина, вирощена в певних умовах, матиме свій унікальний фенотип. Яскравим прикладом є насіння фіолетової коноплі. На фотографії ви бачите яскраво-пурпурні суцвіття, а виростивши їх в індорі, отримаєте максимум ледь світло-фіолетовий відтінок. Можна вирішити, що вас обдурили, але насправді, можливо, для прояву цього фенотипу просто не вистачило умов.</p>

        </div>
    </section>

    <section class="content subscribe pt-5 pb-5">
        <div class="container">

            <div class="row justify-content-center">
                <div class="col-12 col-md-8 col-lg-6">

                    <div class="card card-subscribe mt-5 text-center">
                        <div class="card-body p-5">
                            <h2 class="title mb-2 fw-bold">Підпишіться та будьте в курсі новинок</h2>

                            <div class="description px-lg-5">
                                <p>Ознайомтеся з актуальними новинами про коноплі, порадами, освітою та іншим.</p>
                            </div>

                            <form-subscribe-component></form-subscribe-component>
                        </div>
                    </div>

                </div>
            </div>

        </div>
    </section>
@endsection
